uzxans/STM32_Monn/Core/Src/main.c
extern const char *snmp_community[];
extern const char *snmp_community_write[];
extern const char *snmp_trap_community[];

// --- SNMP ---
char snmp_read[32] = "public";
char snmp_write[32] = "private";
char snmp_trap[32] = "public";
uint8_t apply_snmp_settings = 0;

// CGI-хэндлер для SNMP
const char* SNMP_CGI_Handler(int iIndex, int iNumParams, char *pcParam[], char *pcValue[])
{
    for(int i=0; i<iNumParams; i++)
    {
        if(strcmp(pcParam[i],"snmp-read")==0 && pcValue[i][0]!='\0')
        {
            strncpy(snmp_read, pcValue[i], sizeof(snmp_read)-1);
            snmp_read[sizeof(snmp_read)-1] = 0;
        }
        else if(strcmp(pcParam[i],"snmp-write")==0 && pcValue[i][0]!='\0')
        {
            strncpy(snmp_write, pcValue[i], sizeof(snmp_write)-1);
            snmp_write[sizeof(snmp_write)-1] = 0;
        }
        else if(strcmp(pcParam[i],"snmp-trap")==0 && pcValue[i][0]!='\0')
        {
            strncpy(snmp_trap, pcValue[i], sizeof(snmp_trap)-1);
            snmp_trap[sizeof(snmp_trap)-1] = 0;
        }
    }
    apply_snmp_settings = 1; // ставим флаг применения в main()
    return "/settings.html";  // редирект обратно
}

// Таблица CGI для SNMP
const tCGI SNMP_CGI = {"/set_snmp.cgi", SNMP_CGI_Handler};

#include "stm32f2xx_hal.h"
#include <string.h>
#include <stdbool.h>

#define FLASH_SNMP_ADDR  0x080E0000  // выбери свободный сектор

void Save_SNMP_Settings_To_Flash(const char* read, const char* write, const char* trap)
{
    HAL_FLASH_Unlock();

    FLASH_EraseInitTypeDef eraseInit;
    uint32_t pageError = 0;

    eraseInit.TypeErase = FLASH_TYPEERASE_SECTORS;
    eraseInit.Sector = FLASH_SECTOR_11;   // зависит от твоего чипа!
    eraseInit.NbSectors = 1;
    eraseInit.VoltageRange = FLASH_VOLTAGE_RANGE_3;

    HAL_FLASHEx_Erase(&eraseInit, &pageError);

    uint32_t address = FLASH_SNMP_ADDR;

    HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, address, *((uint32_t*)read));
    address += 4;
    HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, address, *((uint32_t*)write));
    address += 4;
    HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, address, *((uint32_t*)trap));

    HAL_FLASH_Lock();
}


// Попытка OTA: область для приёма прошивки. ВНИМАНИЕ:
// Для STM32F207VCTx (256KB) приложение в текущей сборке занимает сектор 5 (0x08020000..0x0803FFFF),
// поэтому место для OTA, скорее всего, недоступно. Код ниже выполняет безопасные проверки
// и откажется от обновления, если область занята (не пустая), чтобы не "убить" прошивку.
#define FLASH_UPDATE_ADDR   0x08020000U    // предполагаемый слот OTA (Sector 5, 128KB)
#define FLASH_UPDATE_END    0x08040000U
#define RAM_BUFFER_SIZE     (8*1024)       // небольшой буфер для выравнивания

typedef struct {
    uint8_t buffer[RAM_BUFFER_SIZE];
    uint32_t buffer_len;
    uint32_t total_len;
    bool active;
    bool error;
    uint32_t write_addr;
    uint8_t word_buf[4];
    uint8_t word_buf_len;
    uint32_t crc;
    bool erased;
} FW_Update_Context;

FW_Update_Context fw_ctx;
static bool fw_request_active = false;   // текущий POST = fw_update?
static bool login_request_active = false; // текущий POST = login?
// --- Helpers for Flash OTA ---
static uint32_t Flash_GetSector(uint32_t Address)
{
    if (Address < 0x08004000U) return FLASH_SECTOR_0;
    if (Address < 0x08008000U) return FLASH_SECTOR_1;
    if (Address < 0x0800C000U) return FLASH_SECTOR_2;
    if (Address < 0x08010000U) return FLASH_SECTOR_3;
    if (Address < 0x08020000U) return FLASH_SECTOR_4;
    return FLASH_SECTOR_5; // up to 0x0803FFFF for 256KB devices
}

static bool Flash_IsBlank(uint32_t addr, uint32_t bytes_to_check)
{
    for (uint32_t off = 0; off < bytes_to_check; off += 4) {
        uint32_t v = *(volatile uint32_t *)(addr + off);
        if (v != 0xFFFFFFFFU) return false;
    }
    return true;
}

static void FW_ResetContext(void)
{
    fw_ctx.active = false;
    fw_ctx.error = false;
    fw_ctx.buffer_len = 0;
    fw_ctx.total_len = 0;
    fw_ctx.write_addr = FLASH_UPDATE_ADDR;
    fw_ctx.word_buf_len = 0;
    fw_ctx.crc = 0xFFFFFFFFU;
    fw_ctx.erased = false;
}

static inline void FW_CrcUpdate(const uint8_t *data, uint32_t len)
{
    for (uint32_t i = 0; i < len; i++) {
        fw_ctx.crc ^= data[i];
        for (uint8_t j = 0; j < 8; j++) {
            fw_ctx.crc = (fw_ctx.crc >> 1) ^ (0xEDB88320U & (~(fw_ctx.crc & 1U) + 1U));
        }
    }
}

static HAL_StatusTypeDef FW_EnsureErasedForAddress(uint32_t address)
{
    if (fw_ctx.erased) return HAL_OK;
    // Проверка: область должна быть пустой, иначе это часть прошивки — отменяем OTA
    if (!Flash_IsBlank(FLASH_UPDATE_ADDR, 1024U)) { // проверим первые 1KB
        fw_ctx.error = true;
        return HAL_ERROR;
    }

    FLASH_EraseInitTypeDef erase;
    uint32_t pageError = 0;
    erase.TypeErase = FLASH_TYPEERASE_SECTORS;
    erase.VoltageRange = FLASH_VOLTAGE_RANGE_3;
    erase.Sector = Flash_GetSector(address);
    erase.NbSectors = 1; // стираем только сектор слота OTA
    HAL_StatusTypeDef st = HAL_FLASHEx_Erase(&erase, &pageError);
    if (st == HAL_OK) fw_ctx.erased = true;
    else fw_ctx.error = true;
    return st;
}

static HAL_StatusTypeDef FW_FlashWriteStream(const uint8_t *data, uint32_t len)
{
    // Обеспечиваем стирание перед первой записью
    if (!fw_ctx.erased) {
        HAL_StatusTypeDef est = FW_EnsureErasedForAddress(fw_ctx.write_addr);
        if (est != HAL_OK) return est;
    }

    // Обновляем CRC по потоку
    FW_CrcUpdate(data, len);

    uint32_t idx = 0;
    // Дополним незавершённое слово, если было
    if (fw_ctx.word_buf_len > 0) {
        while (fw_ctx.word_buf_len < 4 && idx < len) {
            fw_ctx.word_buf[fw_ctx.word_buf_len++] = data[idx++];
        }
        if (fw_ctx.word_buf_len == 4) {
            uint32_t word;
            memcpy(&word, fw_ctx.word_buf, 4);
            if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, fw_ctx.write_addr, word) != HAL_OK) return HAL_ERROR;
            fw_ctx.write_addr += 4;
            fw_ctx.word_buf_len = 0;
        }
    }

    // Пишем целыми словами напрямую из входного буфера
    while ((idx + 4) <= len) {
        uint32_t word;
        memcpy(&word, &data[idx], 4);
        if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, fw_ctx.write_addr, word) != HAL_OK) return HAL_ERROR;
        fw_ctx.write_addr += 4;
        idx += 4;
        if (fw_ctx.write_addr >= FLASH_UPDATE_END) { fw_ctx.error = true; return HAL_ERROR; }
    }

