uzxans/STM32_Monn/Core/Src/main.c
    // Остаток < 4 байт сохраняем в буфер до завершения
    while (idx < len) {
        fw_ctx.word_buf[fw_ctx.word_buf_len++] = data[idx++];
    }
    return HAL_OK;
}

// CRC32 функция (можно заменить на HAL/STM32 встроенную)
uint32_t crc32(uint8_t *data, uint32_t len)
{
    uint32_t crc = 0xFFFFFFFF;
    for(uint32_t i = 0; i < len; i++) {
        crc ^= data[i];
        for(uint8_t j = 0; j < 8; j++)
            crc = (crc >> 1) ^ (0xEDB88320 & (~(crc & 1) + 1));
    }
    return ~crc;
}

// --- CGI ---
const char* FW_Update_CGI_Handler(int iIndex, int iNumParams, char *pcParam[], char *pcValue[])
{
    return "/update.html";
}

const tCGI FW_UPDATE_CGI = {"/fw_update.cgi", FW_Update_CGI_Handler};

// --- POST обработчики ---
err_t httpd_post_begin(void *connection,
                       const char *uri,
                       const char *http_request,
                       u16_t content_len,
                       int total_data_len,
                       char *post_data,
                       u16_t post_data_len,
                       u8_t *connection_status)
{
    // Сброс признаков по умолчанию
    fw_request_active = false;
    login_request_active = false;

    // Обработка логина: проверяем креды при POST /login.cgi
    if(strcmp(uri, "/login.cgi") == 0) {
        login_request_active = true;
        if (post_data && post_data_len > 0) {
            char user[32]={0}, pass[32]={0};
            char *u = strstr(post_data, "user=");
            char *p = strstr(post_data, "pass=");
            if (u) {
                u += 5;
                size_t n = 0; while (u[n] && u[n] != '&' && n < sizeof(user)-1) { user[n]=u[n]; n++; }
                user[n]=0;
            }
            if (p) {
                p += 5;
                size_t n = 0; while (p[n] && p[n] != '&' && n < sizeof(pass)-1) { pass[n]=p[n]; n++; }
                pass[n]=0;
            }
            extern volatile uint8_t g_is_authenticated;
            g_is_authenticated = (user[0] && pass[0] && Creds_CheckLogin(user, pass)) ? 1 : 0;
        }
        *connection_status = 1;
        return ERR_OK;
    }
    if(strcmp(uri, "/fw_update.cgi") == 0) {
        fw_request_active = true;
        FW_ResetContext();
        // Если слот OTA потенциально пересекается с текущей прошивкой (не пустой) — не начинаем запись
        if (!Flash_IsBlank(FLASH_UPDATE_ADDR, 1024U)) {
            fw_ctx.error = true;
            fw_ctx.active = false;
            *connection_status = 0; // не буферизуем лишние данные
            return ERR_OK;
        }
        fw_ctx.active = true;
        *connection_status = 1; // продолжаем принимать
        HAL_FLASH_Unlock();
    }
    return ERR_OK;
}



err_t httpd_post_receive_data(void *connection, struct pbuf *p)
{
    if(!fw_ctx.active || p == NULL) return ERR_OK;

    struct pbuf *q = p;
    while(q) {
        if (FW_FlashWriteStream((const uint8_t*)q->payload, q->len) != HAL_OK) {
            fw_ctx.error = true;
            fw_ctx.active = false;
            break;
        }
        fw_ctx.total_len += q->len;
        q = q->next;
    }
    return ERR_OK;
}

void httpd_post_finished(void *connection, char *response_uri, u16_t response_uri_len)
{
    // Если это был login — перенаправим по результату авторизации
    if (login_request_active) {
        if (response_uri && response_uri_len) {
            extern volatile uint8_t g_is_authenticated;
            if (g_is_authenticated) {
                strncpy(response_uri, "/index.html", response_uri_len);
            } else {
                strncpy(response_uri, "/login_failed.html", response_uri_len);
            }
        }
        return;
    }

    // Если это был fw_update — завершим запись и отдадим соответствующую страницу
    if (fw_request_active) {
        // Завершаем запись: дописываем неполное слово, если нужно
        if (fw_ctx.active && !fw_ctx.error) {
            if (fw_ctx.word_buf_len > 0) {
                while (fw_ctx.word_buf_len < 4) fw_ctx.word_buf[fw_ctx.word_buf_len++] = 0xFF;
                uint32_t word;
                memcpy(&word, fw_ctx.word_buf, 4);
                if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, fw_ctx.write_addr, word) != HAL_OK) {
                    fw_ctx.error = true;
                } else {
                    fw_ctx.write_addr += 4;
                }
            }
        }
        HAL_FLASH_Lock();
        fw_ctx.active = false;
        if (response_uri && response_uri_len) {
            if (fw_ctx.error || fw_ctx.total_len == 0) {
                strncpy(response_uri, "/update.html", response_uri_len);
            } else {
                strncpy(response_uri, "/update_complete.html", response_uri_len);
            }
        }
        return;
    }
}


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_I2C1_Init();
  MX_LWIP_Init();
  MX_ADC1_Init();
  MX_TIM3_Init();
  MX_RTC_Init();
  /* USER CODE BEGIN 2 */
  // Инициализация логина/пароля (admin/admin по умолчанию)
  Creds_Init();
  Settings_Init();

  ip4_addr_t bk_ip, bk_mask, bk_gw;
  uint8_t bk_dhcp;
  char bk_snmp_read[32], bk_snmp_write[32], bk_snmp_trap[32];

  Settings_Load_From_Backup(&bk_ip, &bk_mask, &bk_gw, &bk_dhcp,
                            bk_snmp_read, sizeof(bk_snmp_read),
                            bk_snmp_write, sizeof(bk_snmp_write),
                            bk_snmp_trap, sizeof(bk_snmp_trap));

  // Apply saved network settings on boot if present
  if (bk_dhcp || bk_ip.addr != 0) {
      netif_set_down(&gnetif);
      if (bk_dhcp) {
          dhcp_start(&gnetif);
      } else {
          netif_set_addr(&gnetif, &bk_ip, &bk_mask, &bk_gw);
      }
      netif_set_up(&gnetif);
  }

  /* Инициализируем SNMP community из backup */
  if (bk_snmp_read[0])  strncpy(snmp_read,  bk_snmp_read,  sizeof(snmp_read)-1);
  if (bk_snmp_write[0]) strncpy(snmp_write, bk_snmp_write, sizeof(snmp_write)-1);
  if (bk_snmp_trap[0])  strncpy(snmp_trap,  bk_snmp_trap,  sizeof(snmp_trap)-1);
  /* Применяем к SNMP-агенту на старте */
  snmp_community[0] = snmp_read;
  snmp_community_write[0] = snmp_write;
  snmp_set_community_trap(snmp_trap);


  httpd_init();

  httpd_ssi_init_custom();

